# InitialIlluminanceIntensity Class

---
This class encapsulates initial illuminance intensity calculation.
SystemObject Autodesk.Revit.DB.LightingInitialIntensity Autodesk.Revit.DB.LightingInitialIlluminanceIntensity
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class InitialIlluminanceIntensity : InitialIntensity

    Public Class InitialIlluminanceIntensity
    	Inherits InitialIntensity

    public ref class InitialIlluminanceIntensity : public InitialIntensity

    type InitialIlluminanceIntensity =
        class
            inherit InitialIntensity
        end
The InitialIlluminanceIntensity type exposes the following members.
| Name| Description
---|---|---
| InitialIlluminanceIntensity(InitialIlluminanceIntensity)|  Creates a copy of the given initial illuminance intensity object
| InitialIlluminanceIntensity(Double, Double)|  Creates an initial illuminance intensity object with the given document and illuminance values.
Top
| Name| Description
---|---|---
| Distance|  The illuminance intensity distance value.
| Illuminance|  The illuminance intensity value.
| InitialIntensityValue|  The calculated initial intensity value. (Inherited from InitialIntensity)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from InitialIntensity)
Top
| Name| Description
---|---|---
| Clone|  Creates a copy of the InitialIntensity derived object. (Inherited from InitialIntensity)
| Dispose| (Inherited from InitialIntensity)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Lighting Namespace